In [1]:
#Now we'll learn about Selecting Entries
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

In [9]:
#Lets try some Series indexing
ser1 = Series(np.arange(3),index=['A','B','C'])

#multiply all values by 2, to avoid confusion in future
ser1 = 2*ser1

#Show
ser1

A    0
B    2
C    4
dtype: int32

In [11]:
#Can grab entry by index name
ser1['B']

2

In [13]:
#Or grab by index 
ser1[1]

2

In [15]:
#Can also grab by index range
ser1[0:3]

A    0
B    2
C    4
dtype: int32

In [16]:
#Or grab range by range of index values
ser1[['A','B','C']]

A    0
B    2
C    4
dtype: int32

In [17]:
#Or grab by logic
ser1[ser1>3]

C    4
dtype: int32

In [19]:
#Can also ser using these methods
ser1[ser1>3] = 10

#Show
ser1

A     0
B     2
C    10
dtype: int32

In [20]:
#Now let's see sleection in a DataFrame

dframe = DataFrame(np.arange(25).reshape((5,5)),index=['NYC','LA','SF','DC','Chi'],columns=['A','B','C','D','E'])

#Show
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [21]:
#Select by column name
dframe['B']

NYC     1
LA      6
SF     11
DC     16
Chi    21
Name: B, dtype: int32

In [23]:
#Select by multiple columns
dframe[['B','E']]

      B   E
NYC   1   4
LA    6   9
SF   11  14
DC   16  19
Chi  21  24

In [24]:
#Can also use boolean
dframe[dframe['C']>8]

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [25]:
#Can also just shoe a boolean DataFrame
dframe> 10

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF   False   True   True   True   True
DC    True   True   True   True   True
Chi   True   True   True   True   True

In [26]:
#Can alos use ix as previously discussed to label-index
dframe.ix['LA']

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int32

In [28]:
#Another example
dframe.ix[1]

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int32

In [1]:
#Next we'll learn about data alignment!

# Notes

In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [4]:
ser1 = Series(np.arange(3), index=['a', 'b', 'c'])

ser1 = 2*ser1

ser1

a    0
b    2
c    4
dtype: int64

In [5]:
ser1['b']

2

In [6]:
ser1[1]

2

In [7]:
ser1[0:3]

a    0
b    2
c    4
dtype: int64

In [10]:
ser1[['a', 'b']]

a    0
b    2
dtype: int64

In [14]:
ser1[ser1>3]

c    4
dtype: int64

In [16]:
ser1[ser1>3] = 10

ser1

a     0
b     2
c    10
dtype: int64

In [29]:
dframe = DataFrame(np.arange(25).reshape(5, 5), index=['NYC', 'LA', 'SF', 'DC', 'Chi'],
                   columns=['A', 'B', 'C', 'D', 'E'])
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [18]:
dframe['B']

NYC     1
LA      6
SF     11
DC     16
Chi    21
Name: B, dtype: int64

In [22]:
dframe[['B', 'C']]

      B   C
NYC   1   2
LA    6   7
SF   11  12
DC   16  17
Chi  21  22

In [23]:
dframe[dframe['C'] > 8]

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [33]:
dframe > 10

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF   False   True   True   True   True
DC    True   True   True   True   True
Chi   True   True   True   True   True

In [34]:
dframe[dframe > 10]

        A     B     C     D     E
NYC   NaN   NaN   NaN   NaN   NaN
LA    NaN   NaN   NaN   NaN   NaN
SF    NaN  11.0  12.0  13.0  14.0
DC   15.0  16.0  17.0  18.0  19.0
Chi  20.0  21.0  22.0  23.0  24.0

In [37]:
dframe.loc['LA']

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int64

In [45]:
dframe.iloc[1]

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int64